{
  "ApplicationInsights": {
    "InstrumentationKey": ""
  },
  "AzureVaultName": "",
  "ConnectionStrings": {
    "AuditLogConnectionString": "",
    "DefaultConnection": ""
  },
  "Serilog": {
    "MinimumLevel": "Information",
    "WriteTo": [
      {
        "Name": "Console",
        "Args": {
          "outputTemplate": "{Timestamp:HH:mm:ss.fff zzz} [{Level:u3}] {Message}{NewLine}{Exception}"
        }
      },
      {
        "Name": "RollingFile",
        "Args": {
          "pathFormat": "C:\\MapApplicationLog\\{Date}-MapLog.txt",
          "outputTemplate": "{Timestamp:yyyyMMdd-HHmmss.fff zzz} [{Level:u3}] {Message}{NewLine}{Exception}"
        }
      }
    ]
  },
  "Storage": {
    "FileUploadPath": "",
    "ContentItemRootPath": "",
    "MapPublishingServerExchangePath": "",
    "QvSourceDocumentsPath": "",
    "ApplicationLog": ""
  },
  "Publishing": {
    "AttestationLanguage": "<span class=\"attestation\">I am familiar with this content and verify that:</span><br><br><ul class=\"attestation-items\"><li>This content provides a reasonable solution that satisfies the associated internal and external needs and any applicable standards of practice.</li><li>Appropriate levels of end-user documentation are included.</li><li>Only appropriate users will have access to this content and the list of users with access will be periodically audited and reviewed.</li><li>There is a plan for when this content will be removed.</li><li>Appropriate data and software licenses are in place for all aspects of this content.</li><li>Appropriate Milliman QRM standards and policies were followed in the creation of this content.</li><li>Pre-Release Peer Review has been completed and documented for this content, or this content will only be accessible by Milliman staff.</li><li>The use and retention of client data are consistent with Milliman&apos;s policies and procedures regarding HIPAA&apos;s privacy and security rules.</li></ul>"
  },
  "QvServerHost": "",
  "QdsQmsApiUrl": "",
  "QvsQmsApiUrl": "",
  "QvServerAdminUserAuthenticationDomain": "",
  "QvServerAdminUserName": "",
  "QvServerAdminUserPassword": "",
  "Global": {
    "DomainValidationRegex": "^((\\[[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\])|(([a-zA-Z\\-0-9]+\\.)+[a-zA-Z]{2,}))$",
    "EmailValidationRegex": "^(([^<>()[\\]\\\\.,;:\\s@']+(\\.[^<>()[\\]\\\\.,;:\\s@']+)*)|('.+'))@((\\[[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\])|(([a-zA-Z\\-0-9]+\\.)+[a-zA-Z]{2,}))$",
    "MaxFileUploadSize": 5368709120,
    "VirusScanWindowSeconds": 30,
    "DefaultNewUserWelcomeText": "Welcome to Milliman Access Portal!\r\n\r\nAn account has been created for you in Milliman Access Portal (MAP). MAP will allow you to securely access your Milliman content online.",
    "EmailDisclaimer": "Caveats and Disclaimer:\r\nMilliman shall retain all rights, title and interest (including, without limitation, all copyrights, patents, service marks, trademarks, trade secret and other intellectual property rights) in and to all technical or internal designs, methods, ideas, concepts, know-how, techniques, generic documents and templates that have been previously developed by Milliman or developed during the course of the provision of the Services provided such generic documents or templates do not contain any (Company) Confidential Information or proprietary data. Rights and ownership by Milliman of original technical designs, methods, ideas, concepts, know-how, and techniques shall not extend to or include all or any part of Company's proprietary data or Company Confidential Information. To the extent that Milliman may include in the materials any pre-existing Milliman proprietary information or other protected Milliman materials, Milliman agrees that Company shall be deemed to have a fully paid up license to make copies of the Milliman owned materials as part of this engagement for its internal business purposes and provided that such materials cannot be modified or distributed outside the Company without the written permission of Milliman.",
    "DefaultPasswordResetEmailText": "A password reset request has been received for your Milliman Access Portal account.",
    "ErrorMessageTemplate": "An error occured. Please contact <a href=\"mailto:map.support@milliman.com?subject={0}\">map.support@milliman.com</a> for assistance.",
    "DefaultClientDomainListCountLimit": 3,
    "NonLimitedDomains": "milliman.com;"
  },
  "SupportEmailAddress": "support.78832.5ad4ee0bf11242a6@helpscout.net",
  "PasswordExpirationDays": "60",
  "PasswordHistoryValidatorDays": "180",
  "PasswordHashingIterations": "100000",
  "PasswordBannedWords": [
    "milliman",
    "password",
    "correct horse battery staple",
    "correcthorsebatterystaple"
  ],
  "AccountActivationTokenTimespanDays": "7",
  "PasswordResetTokenTimespanHours": "2"
}
